{
    "titulo": "Algunos Conceptos B치sicos",
    "1": {
        "titulo": [

        ],
        "descripcion": [
            "Escribir una funci칩n que reciba dos n칰meros y devuelva su producto."
        ],
        "campos": {

        },
        "pie": [

        ]
    },
    "2": {
        "titulo": [

        ],
        "descripcion": [
            "Utilizando la funci칩n del ejercicio anterior, escribir un *programa* (un archivo .py)",
            "que pida al usuario dos n칰meros, y luego muestre el producto."
        ],
        "campos": {

        },
        "pie": [

        ]
    },
    "3": {
        "titulo": [

        ],
        "descripcion": [
            "Escribir funciones que permitan:"
        ],
        "campos": {
            "a)": [
                "Calcular el per칤metro de un rect치ngulo dada su base y su altura."
            ],
            "b)": [
                "Calcular el 치rea de un rect치ngulo dada su base y su altura."
            ],
            "c)": [
                "Calcular el 치rea de un rect치ngulo (alineado con los ejes *x* e *y*) dadas sus coordenadas *x1*, *y1*, *x2*, *y2*."
            ],
            "d)": [
                "Calcular el per칤metro de un c칤rculo dado su radio."
            ],
            "e)": [
                "Calcular el 치rea de un c칤rculo dado su radio."
            ],
            "f)": [
                "Calcular el volumen de una esfera dado su radio."
            ],
            "g)": [
                "Dados los catetos de un tri치ngulo rect치ngulo, calcular su hipotenusa."
            ]
        },
        "pie": [

        ]
    },
    "4": {
        "titulo": [

        ],
        "descripcion": [
            "Analizar los siguientes bloques de c칩digo. 쮺u치l ser치 el resultado de ejecutarlos? Verificar la respuesta con el int칠rprete."
        ],
        "campos": {
            "a)": [
                "```python",
                "for i in range(5):",
                "\tprint(i * i)",
                "```"
            ],
            "b)": [
                "```python",
                "for i in range(2, 6):",
                "\tprint(i, 2 ** i)",
                "```"
            ]
        },
        "pie": [

        ]
    },
    "5": {
        "titulo": [

        ],
        "descripcion": [
            "Escribir una funci칩n que, dado un n칰mero entero, permita calcular su factorial."
        ],
        "campos": {

        },
        "pie": [

        ]
    },
    "6": {
        "titulo": [

        ],
        "descripcion": [
            "Escribir funciones que resuelvan los siguientes problemas:"
        ],
        "campos": {
            "a)": [
                "Dados dos n칰meros, imprimir la suma, resta, divisi칩n y multiplicaci칩n de ambos."
            ],
            "b)": [
                "Dado un n칰mero natural 洧녵, imprimir su tabla de multiplicar."
            ]
        },
        "pie": [

        ]
    },
    "7": {
        "titulo": [

        ],
        "descripcion": [
            "Escribir un programa que le pida una palabra al usuario, para luego imprimirla 1000 veces,",
            "en una 칰nica l칤nea, con espacios intermedios."
        ],
        "campos": {

        },
        "pie": [
            "Ayuda: Investigar acerca del par치metro `end` de la funci칩n `print`."
        ]
    }
}