{
    "titulo": "Programas Sencillos",
    "1": {
        "titulo": [
            
        ],
        "descripcion": [
            "Escribir una funci칩n que reciba una cantidad de pesos, una tasa de inter칠s y un n칰mero de a침os y devuelva el monto final a obtener. La f칩rmula a utilizar es:",
            "*洧냤洧녵 = 洧냤 칑 (1 + 洧논/100) ^ 洧녵*",
            "Donde *洧냤* es el capital inicial, *洧논* es la tasa de inter칠s y *洧녵* es el n칰mero de a침os a calcular."
        ],
        "campos": {

        },
        "pie": [
            
        ]
    },
    "2": {
        "titulo": [
            
        ],
        "descripcion": [
            "Utilizando la funci칩n del ejercicio anterior (ejercicio **2.1**), escribir un programa que le pregunte",
            "al usuario la cantidad de pesos inicial, la tasa de inter칠s y el n칰mero de a침os y muestre el monto final a obtener."
        ],
        "campos": {

        },
        "pie": [
            
        ]
    },
    "3": {
        "titulo": [
            
        ],
        "descripcion": [
            "Escribir una funci칩n que convierta un valor dado en grados Fahrenheit a grados Celsius.",
            "Recordar que la f칩rmula para la conversi칩n es:",
            "*洧냧 = (9/5) 칑 洧냤 + 32*"
        ],
        "campos": {

        },
        "pie": [
            
        ]
    },
    "4": {
        "titulo": [
            
        ],
        "descripcion": [
            "Escribir un programa que utilice la funci칩n anterior para generar una tabla de conversi칩n de temperaturas, desde 0 춿F hasta 120 춿F, de 10 en 10."
        ],
        "campos": {

        },
        "pie": [
            
        ]
    },
    "5": {
        "titulo": [
            
        ],
        "descripcion": [
            ""
        ],
        "campos": {
            "a)": [
                "Escribir una funci칩n que dado un n칰mero entero devuelva 1 si el mismo es impar y 0 si fuera par."
            ],
            "b)": [
                "Escribir una funci칩n que dado un n칰mero entero devuelva 0 si el mismo es impar y 1 si fuera par."
            ],
            "c)": [
                "Escribir una funci칩n que dado un n칰mero entero devuelva el d칤gito de las unidades.",
                "Por ejemplo, para `153` debe devolver `3`"
            ],
            "d)": [
                "Escribir una funci칩n que dado un n칰mero devuelva el primer n칰mero m칰ltiplo de 10 inferior a 칠l.",
                "Por ejemplo, para `153` debe devolver `150`"
            ]
        },
        "pie": [
            
        ]
    },
    "6": {
        "titulo": [
            
        ],
        "descripcion": [
            "Escribir un programa que imprima todos los n칰meros pares entre dos n칰meros que se le pidan al usuario."
        ],
        "campos": {

        },
        "pie": [
            
        ]
    },
    "7": {
        "titulo": [
            
        ],
        "descripcion": [
            "Escribir un programa que le pregunte al usuario un n칰mero *洧녵* e imprima los primeros *洧녵* n칰meros triangulares, junto con su 칤ndice.",
            "Los n칰meros triangulares se obtienen mediante la suma de los n칰meros naturales desde 1 hasta *洧녵*.",
            "Es decir, si se piden los primeros 5 n칰meros triangulares, el programa debe imprimir:",
            "```python",
            "1 - 1",
            "2 - 3",
            "3 - 6",
            "4 - 10",
            "5 - 15",
            "```"
        ],
        "campos": {

        },
        "pie": [
            "Nota: Hacerlo usando y sin usar la ecuaci칩n 풖 洧녵 洧녰=1 洧녰 = 洧녵 (洧녵 + 1)/2. 쮺u치l realiza m치s operaciones?"
        ]
    },
    "8": {
        "titulo": [
            
        ],
        "descripcion": [
            "Escribir un programa que tome una cantidad *洧녴* de valores ingresados por el usuario, a cada uno le calcule el factorial",
            "(utilizando la funci칩n escrita en el ejercicio **1.5**) e imprima el resultado junto con el n칰mero de orden correspondiente."
        ],
        "campos": {

        },
        "pie": [
            
        ]
    },
    "9": {
        "titulo": [
            
        ],
        "descripcion": [
            "Escribir un programa que imprima por pantalla todas las fichas de domin칩, de una por l칤nea y sin repetir."
        ],
        "campos": {

        },
        "pie": [
            
        ]
    },
    "10": {
        "titulo": [
            
        ],
        "descripcion": [
            "Modificar el programa anterior (ejercicio **2.9**) para que pueda generar fichas de un juego",
            "que puede tener n칰meros de 0 a *洧녵*."
        ],
        "campos": {

        },
        "pie": [
            
        ]
    }
}